// ++++ Соколов 06.10.2024 - 07.10.24  

// Соколов 06.10.2024 - 07.10.24 Переключатель (Количество/Дата)
&НаСервере
Процедура ДействиеСкидкиПриИзмененииНаСервере()

	Если ДействиеСкидки = 1 Тогда
		Объект.ПериодПредоставления = Неопределено;
		Элементы.ПериодПредоставления.Доступность = Ложь;
		Элементы.КоличествоПосещений.Доступность = Истина;
	ИначеЕсли ДействиеСкидки = 2 Тогда
		Объект.КоличествоПосещений = Неопределено;
		Элементы.КоличествоПосещений.Доступность = Ложь;
		Элементы.ПериодПредоставления.Доступность = Истина; 		 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеСкидкиПриИзменении(Элемент)
	ДействиеСкидкиПриИзмененииНаСервере(); 
КонецПроцедуры



// Соколов 06.10.2024 - 07.10.24  Автоматически заполняем поле "Ответственный"
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
	Объект.Ответственный = ПолучитьПользователя();      
	КонецЕсли;                                        	

КонецПроцедуры  

&НаСервере
Функция ПолучитьПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции


// Соколов 06.10.2024 - 07.10.24 Сообщаем пользователю, что он ввел количество посещений, до которого действует скидка
&НаСервере
Процедура КоличествоПосещенийПриИзмененииНаСервере()     
	
	Сообщить("Данная скидка будет действовать посещений: " + Объект.КоличествоПосещений);   

КонецПроцедуры

&НаКлиенте
Процедура КоличествоПосещенийПриИзменении(Элемент)
	КоличествоПосещенийПриИзмененииНаСервере();   
КонецПроцедуры



// Соколов 06.10.2024 - 07.10.24 Сообщаем пользователю дату, до которой будет действовать скидка
&НаСервере
Процедура ПериодПредоставленияПриИзмененииНаСервере()   
	Сообщить("Данная скидка будет действовать до: " + Объект.ПериодПредоставления); 
КонецПроцедуры

&НаКлиенте
Процедура ПериодПредоставленияПриИзменении(Элемент)
	ПериодПредоставленияПриИзмененииНаСервере();
КонецПроцедуры 

// ++++ Соколов 06.10.2024 - 07.10.24