// ++++ Соколов П. 08.10.2024 - 09.10.24    

//Берем значение введенное пользователем (ИзменитьНаСумму или ИзменитьНаПроцент) и отправляем его на форму документа
&НаКлиенте
Процедура Применить(Команда)
	ТумблерПриИзмененииНаСервере(); 
	
	Если ИзменитьНаСумму <> 0 Тогда   
		Значение = Новый Структура();
		//Значение = ИзменитьНаСумму;
		Параметр = ИзменитьНаСумму;
		Значение.Вставить("Сум", Параметр);	  
		ЭтаФорма.Закрыть(Значение)
	Иначе
		Если ИзменитьНаПроцент <> 0 Тогда
			Значение = Новый Структура();	
			Параметр = ИзменитьНаПроцент;
			Значение.Вставить("Цен", Параметр);
			ЭтаФорма.Закрыть(Значение)
		Иначе
			Значение = 0;         
			Значение = Новый Структура();
			Значение.Вставить("Нео", 0);
			ЭтаФорма.Закрыть(Значение);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
//При изменении тумблера меняем доступность полей ИзменитьНвСумму и ИзменитьНаПроцент
&НаСервере
Процедура ТумблерПриИзмененииНаСервере()
	Если Тумблер = 1 Тогда
		ИзменитьНаПроцент = Неопределено;
		Элементы.ИзменитьНаПроцент.Доступность = Ложь;
		Элементы.ИзменитьНаСумму.Доступность = Истина;
	ИначеЕсли Тумблер = 2 Тогда
		ИзменитьНаСумму = Неопределено;
		Элементы.ИзменитьНаСумму.Доступность = Ложь;
		Элементы.ИзменитьНаПроцент.Доступность = Истина; 		 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТумблерПриИзменении(Элемент)
	ТумблерПриИзмененииНаСервере();
КонецПроцедуры
// ++++ Соколов П. 08.10.2024 - 09.10.24
