//Соколов Петя 01.10.2024 При создании документа Дату ставим равной сегодняшней  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Элементы.Группа1.Видимость = Ложь; 
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
	ТекДата = ТекущаяДата(); 
	Объект.Дата = ТекДата;                      
	КонецЕсли;
	//Элементы.Группа1.Видимость = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
	Объект.Ответственный = ПолучитьПользователя();      
	КонецЕсли; 

КонецПроцедуры   

//Соколов Петя 03.01.2024 При создании документа автоматически заполняем пользователя 
&НаСервере
Функция ПолучитьПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции 


//Соколов Петя 02.10.2024 При проведении документа осуществляем контроль заполнения обязательных полей
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Отказ = Истина;
		Сообщить("Заполните поле Дата");  
	КонецЕсли;    
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаДействия) Тогда
		Отказ = Истина;
		Сообщить("Заполните поле (Дата начала действия)");  
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Отказ = Истина; 
		Сообщить("Заполните Поле Ответственный");
	КонецЕсли;
	
	Если Объект.Услуги.Количество() = 0 Тогда   
		Отказ = Истина;
		Сообщить("Табличная часть пустая. Заполните табличную часть");
	КонецЕсли;      
			
КонецПроцедуры    

//Соколов П 0?.10.24 
&НаСервере
Процедура ПриОткрытииНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры   

// Соколов 07.10.24 - 09.10.24 Групповое изменение цен
&НаКлиенте
Процедура ИзменитьЦены(Команда)
	
	Значение = ОткрытьФормуМодально("Документ.ПрайсЛист.Форма.Форма");    //Получаем значение из формы
	Для Каждого ЭлСтруктуры из Значение цикл
		
		//Если пользователь ввел изменить на сумму
		Если ЭлСтруктуры.Ключ = "Сум" Тогда                               
			
			Объект.ИзменитьНаСумму = ЭлСтруктуры.Значение; 
			Для Каждого Строка Из Объект.Услуги Цикл   
				Строка.Цена = Строка.Цена + Объект.ИзменитьНаСумму;
			КонецЦикла; 
			
		КонецЕсли;
		
		//Если пользователь ввел изменить на процент
		Если ЭлСтруктуры.Ключ = "Цен" Тогда                                
			
			Объект.ИзменитьНаПроцент = ЭлСтруктуры.Значение;
			Для Каждого Строка Из Объект.Услуги Цикл   
				Строка.Цена = Строка.Цена * (1 + (Объект.ИзменитьНаПроцент / 100));
			КонецЦикла;
			
		КонецЕсли;   
		
		//Если пользователь ничего не ввел (3й ключ "Нео")
		Если ЭлСтруктуры.Ключ = "Нео" Тогда
			Объект.ИзменитьНаСумму = 0;
		КонецЕсли;  
		
		//Сообщить(Строка(ЭлСтруктуры.Ключ) + " = " + ЭлСтруктуры.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЦеныНаСервере()
	// Вставить содержимое обработчика. 
	
КонецПроцедуры

//При создании новой строки проверяем, что предыдущая строка не пустая
&НаКлиенте
Процедура УслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Объект.Услуги.Количество() > 0 Тогда
		
		ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;        
		
		Если ТекущаяСтрока.Цена = 0 Тогда
			Сообщить("Введите поле цена");
			Отказ = Истина;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Услуга) Тогда
			Сообщить("Введите поле услуга"); 
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
// Соколов 07.10.24 - 09.10.24 Групповое изменение цен
