Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Продажа.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажа.Клиент КАК Клиент,
	|	Продажа.Комментарий КАК Комментарий,
	|	Продажа.Номер КАК Номер,
	|	Продажа.Основание КАК Основание,
	|	Продажа.Ответственный КАК Ответственный,
	|	Продажа.СтатусОплаты КАК СтатусОплаты,
	|	Продажа.Сумма КАК Сумма,
	|	Продажа.Услуги.(
	|		Количество КАК Количество,
	|		Номенклатура КАК Номенклатура,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.ЕдиницаИзмерения.Наименование КАК НоменклатураЕдиницаИзмеренияНаименование
	|	) КАК Услуги,
	|	Константы.ОрганизацияНаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	Константы.ИНН КАК ИНН,
	|	Продажа.Дата КАК Дата
	|ИЗ
	|	Документ.Продажа КАК Продажа,
	|	Константы КАК Константы
	|ГДЕ
	|	Продажа.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУслугиШапка);  
		
		КоличествоВсего = 0; //
		
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
			ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень()); 
			
			КоличествоВсего = КоличествоВсего + ВыборкаУслуги.Количество;   //
			
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		Подвал.Параметры.СуммаПрописью = ЧислоПрописью(Выборка.Сумма, ,",,,,,,,,0");
		
		Подвал.Параметры.КоличествоВсего = КоличествоВсего;  //   
		
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Функция ЗначениеЧислаДесять() Экспорт
	
	Возврат 10;
	
КонецФункции
